CSI API ETABS v1

# cDesignConcreteSlabDesignStrip Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cDesignStrip DesignStrip { get; }

    ReadOnly Property DesignStrip As cDesignStrip
    	Get

    Dim instance As cDesignConcreteSlab
    Dim value As cDesignStrip

    value = instance.DesignStrip

    property cDesignStrip^ DesignStrip {
    	cDesignStrip^ get ();
    }

    abstract DesignStrip : cDesignStrip with get

#### Property Value

Type: cDesignStrip

See Also

#### Reference

cDesignConcreteSlab Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com